export const GameConfig = {
  SUMMARY_THRESHOLD_CHARS: 8000,

  KEY_CHARACTER_MAX_COUNT: 3,

  GUIDANCE: {
    WORLD_SETTING:
      '你可以创造性地输入你想要的世界观雏形，它们可以是关键词描述，一句名人名言，一部电影，一段对话，或者一首诗！比如："科幻，超级智能；信仰长久以来总能带给我们所有问题的解答。不过它现在却随着弗洛伊德和达尔文一起被冲进下水道；游戏《底特律》"。\n\n然后我会为你扩写成完整的世界观与背景。调整好世界观后请点击「保存世界设定」按钮。',
    CHARACTER_SETTING:
      '接下来请为你的故事设定玩家角色。你可以直接描述，比如「一个退伍老兵，沉默寡言但心地善良」，或「一个好奇心过重的医学院学生」。我会为你生成一份详细的人物档案。调整满意后请点击「保存玩家设定」按钮。',
    KEY_CHARACTER_SETTING:
      '你可以设置至多3个其余关键角色，ta们可以是你的冒险伙伴、你的幻想恋人、让剧情更加有趣的世界线核心人物，或者一只可爱的小狗？\n\n现在开始邀请第一位角色来到这个世界吧，请在对话框输入你的描述！',
    KEY_CHARACTER_NEXT: (index) =>
      `第一位角色已保存！你可以继续邀请第二位角色，或者点击「直接进入故事开幕」开始冒险。\n\n现在开始邀请第${['二', '三'][index - 1]}位角色来到这个世界吧，请在对话框输入你的描述！`,
    KEY_CHARACTER_SAVED: '关键角色已保存，你可以在侧边栏「已邀请的关键角色」中查看。',
    KEY_CHARACTER_MAX:
      '已保存3位关键角色（已达上限），你可以点击「直接进入故事开幕」开始冒险了！',
    STORY_OPENING: '故事即将开幕。',
    SUMMARIZING: '系统正在更新记忆，请稍等片刻。',
    SUMMARY_DONE: '系统已完成自动记忆更新。',
    WORLD_SAVED:
      '世界观已保存，你可以在侧边栏随时查看。如果不需要再调整，请点击「开启人物设定」按钮，进入下一阶段。',
    CHARACTER_SAVED:
      '玩家设定已保存，你可以在侧边栏随时查看，支持手动修改，并在点击「保存修改」后自动存档；如果不需要再调整，请点击「开始其余关键人物设定」或「直接进入故事开幕」。',
    STORY_OPEN_CONFIRM: (count) =>
      `现已保存${count}位关键角色${count > 0 ? '' : '（可跳过此环节）'}，是否直接进入故事开幕？`,
  },

  PLAYER_SKILL_SUPPLEMENT:
    '其余技能：根据时代背景常理自动生成基础数值，需要时据此判定',
};
